[{"title":"PROPHET #42","publisher":"IMAGE COMICS","itemCode":"AUG130706","sellDate":"1/15/2014","price":"3.99","description":"The Prophets learn more of the mysterious creatures that threaten them while Troll bonds with one of the greatest forces in the universe.\r\n\r\n","creators":"(W) Brandon Graham, Simon Roy (A) Simon Roy, Giannis Milonogiannis (CA) Emma Rios"},{"title":"BLACK DYNAMITE #1 OF 4","publisher":"IDW PUBLISHING","itemCode":"JUL130311","sellDate":"1/15/2014","price":"3.99","description":"HE'S A POWDER KEG OF BLACK FURY THAT'S ABOUT TO EXPLODE!  The baddest kung-fu cat to ever appear on screen is coming to comics so you suckers better duck!  Former CIA agent, international ladies man, and sworn ass-kicking enemy of The Man... he's BLACK DYNAMITE-and he's about to walk into the most dangerous journey of his life!  \r\n\r\n","creators":"(W) Brian Ash (A) Sal Buscema, Ron Wimberly (CA) Marcelo Ferreira"},{"title":"DF SUPERIOR CARNAGE #1 SHINICK SGN ED ","publisher":"DYNAMIC FORCES","itemCode":"JUN131103","sellDate":"1/15/2014","price":"16.99","description":"This limited DF signed edition comic comes bagged and boarded with certificate of authenticity!\r\n\r\n","creators":""},{"title":"WARLORD OF MARS #32 ","publisher":"DYNAMIC FORCES","itemCode":"MAY131059","sellDate":"1/15/2014","price":"3.99","description":"John Carter has spilled blood in the service of Helium.  But for thousands of years before his arrival, his adopted homeland suffered at the hands of Mars' other races.  Now, his victories have awakened a legendary hero... one with a genocidal agenda of payback!  When Carter protests, he finds himself on the run alongside his family.  With no friends to turn to, alliances must be made with old enemies!\r\n\r\n","creators":"(W) Arvid Nelson (A) Wagner Reis (CA) Joe Jusko, Lucio Parrillo","mature":true},{"title":"BPRD HELL ON EARTH #115","publisher":"DARK HORSE COMICS","itemCode":"NOV130012","sellDate":"1/15/2014","price":"3.50","description":"Two B.P.R.D. teams make their way through the monster-filled streets of a Manhattan wasteland in order to reach the Black Flame's fortress and take down his army.\r\n\r\n","creators":"(W) Mike Mignola, John Arcudi (A) James Harren (CA) Dave Stewart, Rafael Albuquerque"},{"title":"KISS ME SATAN #5 OF 5","publisher":"DARK HORSE COMICS","itemCode":"NOV130020","sellDate":"1/15/2014","price":"3.99","description":"Barnabus Black infiltrates the werewolf mafia's mansion, only to be overtaken by an army of angry monsters, a dangerous wizard, and their werewolf godfather!\r\n\r\n","creators":"(W) Victor Gischler (A) Juan Ferreyra (CA) Dave Johnson, Juan Ferreyra"},{"title":"CLOWN FATALE #3 OF 4 ","publisher":"DARK HORSE COMICS","itemCode":"NOV130021","sellDate":"1/15/2014","price":"3.99","description":"The painted beauties go in guns a-blazin' to earn the bounty they need to crawl out of their squalid clown life. But the girls find out they're not quite as tough as they thought-and when they fail to carry out the job to the letter, the boss decides he wants a refund. \r\n\r\n","creators":"(W) Victor Gischler (A) Maurizio Rosenzweig (CA) Moreno DiNisio, Tim Seeley","mature":true},{"title":"STRAIN THE FALL #7","publisher":"DARK HORSE COMICS","itemCode":"NOV130022","sellDate":"1/15/2014","price":"3.99","description":"Why does Setrakian, an elderly pawnbroker and a vampire expert, keep a still-beating vampiric heart in a jar? The grisly tale behind this gruesome artifact is a heart-wrenching story, but one that fuels revenge! Meanwhile, Dr. Goodweather's capture has taken a turn for the worse as he faces execution . . . by vampire!\r\n\r\n","creators":"(W) David Lapham (A) Mike Huddleston (CA) Dan Jackson, E.M. Gist"},{"title":"STAR WARS DARTH VADER & CRY OF SHADOWS #2 OF 5 ","publisher":"DARK HORSE COMICS","itemCode":"NOV130029","sellDate":"1/15/2014","price":"3.50","description":"Clone trooper Hock has been through much since being left for dead by his Jedi leaders in the Clone Wars. Now, Hock believes he has found a truly great warrior who deserves loyalty and commands respect-Darth Vader! If Hock can impress the Dark Lord as a stormtrooper, he will have earned respect of his own from the leader he admires most.\r\n\r\n","creators":"(W) Tim Siedell (A) Gabriel Guzman (CA) Michael Atiyeh, Felipe Massafera"},{"title":"STAR WARS DAWN O/T JEDI FORCE WAR #3 OF 5 ","publisher":"DARK HORSE COMICS","itemCode":"NOV130030","sellDate":"1/15/2014","price":"3.50","description":"Je'daii generals Daegen Lok and Xesh are captured by Xesh's former Rakatan masters, and Xesh learns the truth behind his arrival on Tython. Half-mad with regret, he is forced to give the invaders the knowledge they need to defeat Xesh's Je'daii friends-and enslave the entire planet!\r\n\r\n","creators":"(W) John Ostrander (A) Dan Parsons, Jan Duursema (CA) Wes Dziboa, David Michael Beck"},{"title":"SKYMAN #1 OF 4","publisher":"DARK HORSE COMICS","itemCode":"NOV130045","sellDate":"1/15/2014","price":"2.99","description":"After an embarrassing defeat at the hands of Captain Midnight, a drunken Skyman accidentally kills an innocent man! Needing a new face for their initiative ASAP, the Skyman Program turns to US Air Force Sgt. Eric Reid: a wounded veteran on the ropes, looking for a new lease on life. \r\n\r\n","creators":"(W) Joshua Hale Fialkov (A) Manuel Garcia,   Bit (CA) Freddie Williams II, Dan Scott"},{"title":"X #9 ","publisher":"DARK HORSE COMICS","itemCode":"NOV130050","sellDate":"1/15/2014","price":"2.99","description":"Everyone in Arcadia knows: commit a crime, and sooner or later X will come for you. But how to get his attention if you want to die right now? And what if the notorious vigilante doesn't want to execute a willing victim? It's a clash of wills as X's newest, most formidable nemesis takes the stage!\r\n\r\n","creators":"(W) Duane Swierczynski (A) Eric Nguyem (CA) Michelle Madsen, Dave Wilkins","mature":true},{"title":"SHOOT FIRST #4 OF 4","publisher":"DARK HORSE COMICS","itemCode":"NOV130053","sellDate":"1/15/2014","price":"3.99","description":"The angels have found what they need to invoke the end of the world-and the Secular Humanist Occult Obliteration Taskforce is the only thing standing in their way. S.H.O.O.T. is changed forever in the action-packed conclusion to the miniseries everyone is talking about!\r\n\r\n","creators":"(W) Justin Aclin (A) Nicolas Daniel Selma (CA) Nicolas Daniel Selma,   Marlac"},{"title":"JUSTICE LEAGUE OF AMERICA #11 (EVIL)","publisher":"DC COMICS","itemCode":"NOV130126","sellDate":"1/15/2014","price":"3.99","description":"A FOREVER EVIL tie-in! Survivors Martian Manhunter and Stargirl make a perilous trek across a Super-Villain occupied United States. Their first stop may be the last as they enter Gotham City and Clayface-occupied territory! \r\n\r\n","creators":"(W) Matt Kindt (A/CA) Eddy Barrows, Eber Ferreira"},{"title":"JUSTICE LEAGUE OF AMERICA #11","publisher":"DC COMICS","itemCode":"NOV130129","sellDate":"1/15/2014","price":"4.99","description":"A FOREVER EVIL tie-in! Survivors Martian Manhunter and Stargirl make a perilous trek across a Super-Villain occupied United States. Their first stop may be the last as they enter Gotham City and Clayface-occupied territory!  This issue is also offered as a combo pack edition with a redemption code for a digital download of this issue.\r\n\r\n","creators":"(W) Matt Kindt (A/CA) Eddy Barrows, Eber Ferreira"},{"title":"CONSTANTINE #10 (EVIL)","publisher":"DC COMICS","itemCode":"NOV130131","sellDate":"1/15/2014","price":"2.99","description":"A FOREVER EVIL tie-in! Brought low by the evil of Blight, Constantine struggles to rally his mystical allies and turn the tide of battle. Only one thing stands in his path: the righteous wrath of The Spectre! Continued in this month's TRINITY OF SIN: PANDORA #7!\r\n\r\n","creators":"(W) Ray Fawkes (A)   Aco (CA) Howard Porter"},{"title":"FOREVER EVIL ROGUES REBELLION #4 OF 6","publisher":"DC COMICS","itemCode":"NOV130139","sellDate":"1/15/2014","price":"2.99","description":"The Rogues just can't catch a break! On the run from the Crime Syndicate and the Secret Society, the Rogues are forced into a showdown with an army of escapees from Arkham Asylum!\r\n\r\n","creators":"(W) Brian Buccellato (A) Scott Hepburn (CA) Declan Shalvey"},{"title":"SUICIDE SQUAD #27 (EVIL)","publisher":"DC COMICS","itemCode":"NOV130141","sellDate":"1/15/2014","price":"2.99","description":"A FOREVER EVIL tie-in! As Amanda Waller and James Gordon Jr. fight for their lives in the bowels of Belle Reve, Deadshot and the Squad struggle to survive a deadly trap that one of their own sprung on them!\r\n\r\n","creators":"(W) Matt Kindt (A) Patrick Zircher (CA) Steve Skroce"},{"title":"JUSTICE LEAGUE 3000 #2","publisher":"DC COMICS","itemCode":"NOV130147","sellDate":"1/15/2014","price":"2.99","description":"Before the team can figure out what happened to their memories, Cadmus sends some seemingly familiar faces into the darkness of Commonwealth space to face off against the first member of a new group of villains called LOCUS!\r\n\r\n","creators":"(W) Keith Giffen, J. M. DeMatteis (A/CA) Howard Porter"},{"title":"WORLDS FINEST #19","publisher":"DC COMICS","itemCode":"NOV130153","sellDate":"1/15/2014","price":"2.99","description":"Desperate times call for desperate measures as Power Girl and Huntress reveal their true origins to this world's Superman and Batman! \r\n\r\n","creators":"(W) Paul Levitz (A) R. B. Silva, Joe B. Weems (CA) Emanuela Lupacchino"},{"title":"SUPERMAN WONDER WOMAN #4","publisher":"DC COMICS","itemCode":"NOV130155","sellDate":"1/15/2014","price":"3.99","description":"The secret of Superman and Wonder Woman's relationship is out and the world's reaction is mixed, but that's the least of the power couple's worries as Zod seeks to release Faora from the Phantom Zone! \r\n\r\n","creators":"(W) Charles Soule (A) Tony S. Daniel & Various (CA) Tony S. Daniel"},{"title":"SUPERMAN WONDER WOMAN #4","publisher":"DC COMICS","itemCode":"NOV130157","sellDate":"1/15/2014","price":"4.99","description":"The secret of Superman and Wonder Woman's relationship is out and the world's reaction is mixed, but that's the least of the power couple's worries as Zod seeks to release Faora from the Phantom Zone!  This issue is also offered as a combo pack edition with a redemption code for a digital download of this issue.\r\n\r\n","creators":"(W) Charles Soule (A) Tony S. Daniel & Various (CA) Tony S. Daniel"},{"title":"SUPERBOY #27","publisher":"DC COMICS","itemCode":"NOV130162","sellDate":"1/15/2014","price":"2.99","description":"Part Two of Kara's confrontation with the deadly new Lobo. After last issue's shock ending, this issue we discover an even greater threat in Shay Veritas that will force Supergirl to make a deadly choice! \r\n\r\n","creators":"(W) Marv Wolfman (A) Andres Guinaldo, Norm Rapmund (CA) Rafael Sandoval"},{"title":"BATGIRL #27 (GOTHTOPIA)","publisher":"DC COMICS","itemCode":"NOV130180","sellDate":"1/15/2014","price":"2.99","description":"In this tale tying into \"GOTHTOPIA,\" what kind of sick world pairs up Batgirl and the woman who tried to kill Jim Gordon - Knightfall?!\r\n\r\n","creators":"(W) Gail Simone (A) Fernando Pasarin (CA) Alex Garner"},{"title":"NIGHTWING #27","publisher":"DC COMICS","itemCode":"NOV130187","sellDate":"1/15/2014","price":"2.99","description":"Nightwing's being visited by an old friend from Gotham - the Mad Hatter! Desperate to protect Chicago, Nightwing's been forced into an uneasy alliance with the mysterious Marionette. But who's really pulling the strings? \r\n\r\n","creators":"(W) Kyle Higgins (A/CA) Will Conrad"},{"title":"GREEN LANTERN CORPS #27","publisher":"DC COMICS","itemCode":"NOV130199","sellDate":"1/15/2014","price":"2.99","description":"John Stewart stars in this special issue! GL Sector Houses across the galaxy are being destroyed, and the Durlans unleash a deadly new weapon designed to counter the GL's rings!\r\n\r\n","creators":"(W) Robert Venditti, Van Jensen (A/CA) Bernard Chang"},{"title":"INJUSTICE YEAR TWO #1","publisher":"DC COMICS","itemCode":"NOV130213","sellDate":"1/15/2014","price":"2.99","description":"The best-selling prequel to the hit videogame picks up right where it left off! Year one is over-now, year two begins. The death of one of their own has divided Earth's protectors as hero turns against hero. As Superman's iron grip on the world tightens, at the edge of the galaxy, fear approaches... \r\n\r\n","creators":"(W) Tom Taylor (A) Bruno Redondo (CA) Jheremy Raapack"},{"title":"BATMAN LIL GOTHAM #10","publisher":"DC COMICS","itemCode":"NOV130254","sellDate":"1/15/2014","price":"2.99","description":"DIGITAL FIRST  Ivy looks forward to every fruitful season-except fall, where there is nothing but barren earth to take care of! Join Harley and Selina as they scour the town for something to cheer Ivy up. Also, what secret is hidden deep in the east wing of Wayne Manor? Only Alfred knows for sure! \r\n\r\n","creators":"(W) Dustin Nguyen, Derek Fridolfs (A/CA) Dustin Nguyen"},{"title":"SCOOBY DOO WHERE ARE YOU #41","publisher":"DC COMICS","itemCode":"NOV130258","sellDate":"1/15/2014","price":"2.99","description":"When the Mystery Inc. Gang takes an unexpected Midwestern detour, they make the best of it by visiting sites left by prehistoric North American culture known as the Mound Builders. But have the legendary Annunaki made a return appearance, or is someone looking for the secrets of the mound for themselves? \r\n\r\n","creators":"(W/A/CA) Scott Gross"},{"title":"ASTRO CITY #8","publisher":"DC COMICS","itemCode":"NOV130265","sellDate":"1/15/2014","price":"3.99","description":"When the Confessor investigates the criminal charges against Winged Victory, it leads to open combat-with Samaritan! Can Astro City's three greatest heroes find a way to work together? And even if they can, will it be too late to save her career? The 4-issue story arc continues as the threat against Winged Victory is revealed and her past is explored.\r\n\r\n","creators":"(W) Kurt Busiek (A) Brent Eric Anderson (CA) Alex Ross"},{"title":"COFFIN HILL #4 ","publisher":"DC COMICS","itemCode":"NOV130266","sellDate":"1/15/2014","price":"2.99","description":"Eve's best friend Mel finally emerges from her decade-long fugue state...but is Mel really Mel, or has something sinister found a home behind her eyes? Meanwhile, Eve and Nate search for yet another missing person into the Coffin Hill woods-and land in the lair of a serial killer.\r\n\r\n","creators":"(W) Caitlin Kittredge (A) Inaki Miranda (CA) Dave Johnson","mature":true},{"title":"X-FILES CONSPIRACY #1 OF 2","publisher":"IDW PUBLISHING","itemCode":"NOV130294","sellDate":"1/15/2014","price":"3.99","description":"The event of the year begins here! When The Lone Gunmen discover Internet files from future, they learn that a plague will soon wipe out most of humanity. With Agents Mulder and Scully working one lead, the Gunmen must spring into action and investigate several urban legends: a group of ghost-hunters, mutant turtles that live in the sewers, shape-changing alien robots, and a vengeful spirit from beyond the grave!\r\n\r\n","creators":"(W) Paul Crilley (A) John Stanisci (CA) Miran Kim"},{"title":"X-FILES SEASON 10 #1","publisher":"IDW PUBLISHING","itemCode":"NOV130303","sellDate":"1/15/2014","price":"4.99","description":"The X-Files: Season 10 from IDW took the world by storm, drawing praise from comic readers and longtime X-Philes alike. Now, in celebration of this acclaimed series, we are proud to release a special Director's Cut of the first issue, which includes all of the covers along with the comic's script, giving a rare insight into the inner workings of a comic book from initial thought to publication. Join series creator Chris Carter, writer Joe Harris (Great Pacific) and artist Michael Walsh (Comeback) as we reprise their story ushering THE X-FILES into a new era!\r\n\r\n","creators":"(W) Joe Harris (A) Michael Walsh (CA) Carlos Valenzuela"},{"title":"TMNT NEW ANIMATED ADVENTURES #7","publisher":"IDW PUBLISHING","itemCode":"NOV130311","sellDate":"1/15/2014","price":"3.99","description":"It's a triple date disaster as three different pairs of friends (and enemies) all make their way to one fateful night at the movies! Will Don impress April? Will Leo win Karai over? And will Raph and Mike stop arguing long enough to grab some snacks?! These questions and more are answered in this crazy adventure!\r\n\r\n","creators":"(W) Brian Smith (A) Chad Thomas (CA) Dario Brizuela"},{"title":"MAXX MAXXIMIZED #3","publisher":"IDW PUBLISHING","itemCode":"NOV130329","sellDate":"1/15/2014","price":"3.99","description":"Maxx is confronted by Mr. Gone in the outback, and spills vital clues about how he became the Maxx. Meanwhile, outback Julie retreats to her rock lair and begins the slow process of healing. Completely remastered-each page has been painstakingly scanned from the original art by Sam Kieth, who is also overseeing the new coloring. This is The Maxx better than ever!\r\n\r\n","creators":"(W) Sam Kieth, William Messner-Loebs (A/CA) Sam Kieth"},{"title":"WRAITH WELCOME TO CHRISTMASLAND #3 OF 7","publisher":"IDW PUBLISHING","itemCode":"NOV130331","sellDate":"1/15/2014","price":"3.99","description":"Three escaped convicts are looking for a set of wheels that can carry them to freedom. Charlie Manx has just the ride they need... but when they get to Christmasland, they'll wish they went to prison instead. Ten years of hard time looks pretty easy compared to 24 hours in a frozen graveyard disguised as the world's coldest, cruelest amusement park.\r\n\r\n","creators":"(W) Joe Hill (A/CA) Charles Paul Wilson III"},{"title":"MY LITTLE PONY FRIENDSHIP IS MAGIC #15","publisher":"IDW PUBLISHING","itemCode":"NOV130337","sellDate":"1/15/2014","price":"3.99","description":"Things are getting positively bookish in Ponyville! When a magical bookworm starts to cause some literary mischief, it's only a matter of time before things start to get out of hoof! It's up to our ponies to set things right... but will they want to when Daring Do shows up? \r\n\r\n","creators":"(W) Heather Nuhfer (A) Amy Mebberson (CA) Agnes Garbowska, Amy Mebberson"},{"title":"POWERPUFF GIRLS #5","publisher":"IDW PUBLISHING","itemCode":"NOV130348","sellDate":"1/15/2014","price":"3.99","description":"Oh NO, it looks like Buttercup was right all along! The Ex-Villains have reverted to their old ways and are tearing up Townsville! The Powerpuff Girls are out-numbered but never outmatched-that is, until the horrible shadow of HIM falls across the battlefield. Just when you thought things couldn't get any worse, huh? \r\n\r\n","creators":"(W/A/CA) Troy Little"},{"title":"BEN 10 #3","publisher":"IDW PUBLISHING","itemCode":"NOV130350","sellDate":"1/15/2014","price":"3.99","description":"Ben 10's Omniverse universe-set high-seas adventure continues! Ben has joined forces with the heroic mer-people of TerraPisciss, but now the undersea kingdom is under threat from the forces of Ssserpent...! \r\n\r\n","creators":"(W) Jason Henderson (A) Gordon Purcell (CA) Eddie Nunez"},{"title":"GI JOE A REAL AMERICAN HERO #198","publisher":"IDW PUBLISHING","itemCode":"NOV130356","sellDate":"1/15/2014","price":"3.99","description":"The March to RAH #200 Continues! As things heat up in Sierra Gordo, SCARLETT and SNAKE EYES race against the clock to save G.I. JOE's HQ, The Pit, from the sinister grip of COBRA. \r\n\r\n","creators":"(W) Larry Hama (A/CA) SL Galant"},{"title":"GI JOE SPECIAL MISSIONS #11","publisher":"IDW PUBLISHING","itemCode":"NOV130363","sellDate":"1/15/2014","price":"3.99","description":"Destro Must Die, Part Two! Copperback is on the loose! The Joes recruited the devious diva to lead them to Destro but the hunt turns into a chase across the globe with Destro's life on the line and a killer new B.A.T. program that will shift the balance of power to Cobra's favor.\r\n\r\n","creators":"(W) Chuck Dixon (A) Paul Gulacy (CA) Paul Gulacy, Will Rosado"},{"title":"TRANSFORMERS MORE THAN MEETS EYE #25","publisher":"IDW PUBLISHING","itemCode":"NOV130365","sellDate":"1/15/2014","price":"3.99","description":"A HERO FALLS-AND ONE RETURNS! The struggle in the DEAD UNIVERSE heats up as ORION PAX-the 'bot who was once OPTIMUS PRIME-and RODIMUS struggle with the legacy of PRIMES! Meanwhile, the Lost Light is under attack in deep space-and SHOCKWAVE and the terrifying NECROTITAN threatens CYBERTRON! \r\n\r\n","creators":"(W) James Roberts, John Barber (A) James Raiz & Various (CA) Casey Coller"},{"title":"TRIPLE HELIX #4 OF 4","publisher":"IDW PUBLISHING","itemCode":"NOV130384","sellDate":"1/15/2014","price":"3.99","description":"What do you do when everything you know turns out to be a lie-even that? The team faces the literal end of the world-and even the CONCLAVE may have arrived too late to help. \r\n\r\n","creators":"(W/A/CA) John Byrne"},{"title":"ILLEGITIMATES #2 OF 6","publisher":"IDW PUBLISHING","itemCode":"NOV130388","sellDate":"1/15/2014","price":"3.99","description":"The Illegitimates are assembled and identities revealed as Dannikor's world-changing plot kicks into gear! Can these kids process their newly revealed parentage and, more importantly, get along long enough to embrace their legacies and save the planet from a zombified doom? And, hey, what about the Illegitimates' moms...?\r\n\r\n","creators":"(W) Taran Killam, Marc Andreyko (A/CA) Kevin Sharpe"},{"title":"GATE WAY #1 OF 4","publisher":"IDW PUBLISHING","itemCode":"NOV130390","sellDate":"1/15/2014","price":"3.99","description":"In a surreal setting where a red sky burns bright and the blanket of night brings a terror known only as the Dark Souls, ex-cop Jake Ryan struggles to make sense of his surroundings. Purgatory is a story that weaves a rich tapestry of loyalty, lust, intrigue and betrayal as beggars, thieves, priests, and murderers all vie for power in a world that rewards the bold and enslaves the weak. \r\n\r\n","creators":"(W) Joe Halpin Sr (A/CA) Moyano Juanfrancisco"},{"title":"INDESTRUCTIBLE #2","publisher":"IDW PUBLISHING","itemCode":"NOV130391","sellDate":"1/15/2014","price":"3.99","description":"Everyone has questions for Greg Pincus, the world's newest-and most accidental-superhero. But if Greg thought dealing with groupies, paparazzi, and the po-po was maddening, wait until he meets the self-important, sniping League of Defenders! \r\n\r\n","creators":"(W) Jeff Kline (A) Javi Garron, Salvia Garcia (CA) Jose Lopez"},{"title":"POPEYE CLASSICS ONGOING #18","publisher":"IDW PUBLISHING","itemCode":"NOV130396","sellDate":"1/15/2014","price":"3.99","description":"Good fortune is coming your way when you snag the new Popeye Classics comic book! Yes,  a cool old-skool comic that adults and kids can both enjoy. Bud Sagendorf's genius action and wackness in \"The Box\", \"Kitty,Kitty\", \"The Tunnel\" and a hilarious Wimpy comic \"Duck Dinner\". Oh, and a special non-Popeye story, \"Sammy Bug's Big Leap!\"...and MORE! \r\n\r\n","creators":"(W/A/CA) Bud Sagendorf"},{"title":"EGOS #1","publisher":"IMAGE COMICS","itemCode":"NOV130415","sellDate":"1/15/2014","price":"2.99","description":"A twisted far-future epic! An aging hero risks everything to rebuild his former team - but to do so, he must cross a line with his wife that can't be uncrossed.  \r\n\r\n","creators":"(W) Stuart Moore (A/CA) Gus Storms"},{"title":"PETER PANZERFAUST #16","publisher":"IMAGE COMICS","itemCode":"NOV130430","sellDate":"1/15/2014","price":"3.50","description":"\"THE HUNT,\" Part One In the aftermath of the assault on The Sticks, the team is fractured and Lily's father is dead. Parsons returns to Lily to hear of what happened and he learns her side of the story for the first time. It's a tale of revenge... with the Hunters becoming the hunted!   THE FOURTH INCREDIBLE STORY ARC BEGINS HERE!\r\n\r\n","creators":"(W) Kurtis J. Wiebe (A/CA) Tyler Jenkins"},{"title":"ALEX + ADA #3","publisher":"IMAGE COMICS","itemCode":"NOV130489","sellDate":"1/15/2014","price":"2.99","description":"Ada is an amazing piece of technology, but Alex realizes she's missing something. He goes in search of it and finds out he's not the only one unhappy with the way things are.\r\n\r\n","creators":"(W) Jonathan Luna, Sarah Vaughn (A/CA) Jonathan Luna"},{"title":"CARBON GREY VOL 3 #2 OF 2 CVR A NGUYEN & LOH","publisher":"IMAGE COMICS","itemCode":"NOV130494","sellDate":"1/15/2014","price":"4.99","description":"\"MOTHERS OF REVOLUTION,\" CONCLUSION The war, which not long ago was everything, now seems insignificant in the face of the unimaginable destructive power of the stone. But there is still hope, for even as the world unravels, mortal enemies unite and the true meaning of Gottfaust's prophecy is revealed in this, the double-length finale to our EPIC saga.  Ships with three covers that may be ordered separately. Cover C is a photo cover featuring Katherine Park as Giselle!\r\n\r\n","creators":"(W) Paul Gardner, Hoang Nguyen (A) Khari Evans & Various (CA) Hoang Nguyen, Kinsun Loh"},{"title":"CARBON GREY VOL 3 #2 OF 2 CVR B NGUYEN & LOH","publisher":"IMAGE COMICS","itemCode":"NOV130495","sellDate":"1/15/2014","price":"4.99","description":"\"MOTHERS OF REVOLUTION,\" CONCLUSION The war, which not long ago was everything, now seems insignificant in the face of the unimaginable destructive power of the stone. But there is still hope, for even as the world unravels, mortal enemies unite and the true meaning of Gottfaust's prophecy is revealed in this, the double-length finale to our EPIC saga.\r\n\r\n","creators":"(W) Paul Gardner, Hoang Nguyen (A) Khari Evans & Various (CA) Kinsun Loh, Hoang Nguyen"},{"title":"GHOSTED #6 ","publisher":"IMAGE COMICS","itemCode":"NOV130504","sellDate":"1/15/2014","price":"2.99","description":"NEW STORY ARC! After his last job, Jackson Winters won his freedom. But even now, he can't put his very real ghosts to rest. News of his reappearance has spread, and there are people who have waited a long time to use his peculiar talents for all the wrong reasons.\r\n\r\n","creators":"(W) Joshua Williamson (A) Miroslav Mrva, Davide Gianfelice (CA) Matteo Scalera","mature":true},{"title":"PROTECTORS INC #3 CVR A PURCELL & ATIYEH ","publisher":"IMAGE COMICS","itemCode":"NOV130514","sellDate":"1/15/2014","price":"2.99","description":"Lieutenant Detective John Riley gets the most important and possibly most dangerous assignment ever: to investigate the mysterious death of the Huntsman. Everyone around Riley wants him to classify this as an accidental death, or a death by natural causes. But Riley suspects murder, and intends to follow that suspicion wherever it leads...even if in doing so he jeopardizes a secret held for over fifty years at the very core of Protectors, Inc.\r\n\r\n","creators":"(W) J. Michael Straczynski (A/CA) Gordon Purcell, Michael Atiyeh","mature":true},{"title":"PROTECTORS INC #3 CVR B ANDRASOFZKY ","publisher":"IMAGE COMICS","itemCode":"NOV130515","sellDate":"1/15/2014","price":"2.99","description":"Lieutenant Detective John Riley gets the most important and possibly most dangerous assignment ever: to investigate the mysterious death of the Huntsman. Everyone around Riley wants him to classify this as an accidental death, or a death by natural causes. But Riley suspects murder, and intends to follow that suspicion wherever it leads...even if in doing so he jeopardizes a secret held for over fifty years at the very core of Protectors, Inc.\r\n\r\n","creators":"(W) J. Michael Straczynski (A) Gordon Purcell, Michael Atiyeh (CA) Kalman Andrasofszky","mature":true},{"title":"A VOICE IN THE DARK #3 ","publisher":"IMAGE COMICS","itemCode":"NOV130531","sellDate":"1/15/2014","price":"3.99","description":"\"KILLING GAME,\" Part One With freshman year pressures mounting, will Zoey be able to contain her compulsion to murder another student before school lets out for Thanksgiving break?   Written and drawn - by mouth - from disabled creator Larime Taylor.\r\n\r\n","creators":"(W/A/CA) Larime Taylor","mature":true},{"title":"THUNDERBOLTS #20","publisher":"MARVEL COMICS","itemCode":"NOV130595","sellDate":"1/15/2014","price":"2.99","description":"\"NO MERCY\" Part 1 GHOST RIDER JOINS THE THUNDERBOLTS! General Ross's Thunderbolts were brought together to clean up problems no one else could...but what about when the problem is ON the team? The seemingly all-powerful madwoman called Mercy has gone too far, slaughtering innocent people to fulfill her twisted mission of mercy. Who can the team turn to to help take down this powerhouse? How about Johnny Blaze, the original Ghost Rider? Can he save the team before it all goes to hell? Or will he lead them there?\r\n\r\n","creators":"(W) Charles Soule (A) Carlo Barberi (CA) Julian Totino Tedesco"},{"title":"INHUMANITY SPIDER-MAN #1","publisher":"MARVEL COMICS","itemCode":"NOV130621","sellDate":"1/15/2014","price":"3.99","description":"INHUMANITY TIE-IN! •  Atitlan has crashed out of the sky into New York City. •  In the chaos, the Superior Spider-Man discovers that super powers aren't all it takes to be Superior.\r\n\r\n","creators":"(W) Christos N. Gage (A) Stephanie Hans (CA) Jeff Dekal"},{"title":"MIRACLEMAN #1","publisher":"MARVEL COMICS","itemCode":"NOV130622","sellDate":"1/15/2014","price":"5.99","description":"• KIMOTA! With one magic word, a long-forgotten legend lives again! •  Freelance reporter Michael Moran always knew he was meant for something more -- now, a strange series of events leads him to reclaim his destiny! •  Relive the ground-breaking eighties adventures that captured lightning in a bottle -- or experience them for the first time -- in these digitally restored, fully relettered editions! •  Issue 1 includes material originally presented in WARRIOR #1 and MIRACLEMAN #1, plus the MARVELMAN PRIMER. \r\n\r\n","creators":"(W)   TBD, Mick Anglo (A)   Various (CA) Joe Quesada"},{"title":"DISNEY KINGDOMS SEEKERS OF WEIRD #1 OF 5","publisher":"MARVEL COMICS","itemCode":"NOV130638","sellDate":"1/15/2014","price":"3.99","description":"AN ALL-NEW ADVENTURE INSPIRED BY DISNEY'S LEGENDARY BUT NEVER BUILT MUSEUM OF THE WEIRD! •  When their parents are kidnapped, teens Maxwell and Melody are thrust into a thrilling race through the world's most strange and dangerous museum as they unite with their mysterious and swashbuckling uncle to save their family and the world from an evil secret society! •  Envisioned by famous Walt Disney Imagineer Rolly Crump for Walt Disney in 1965, the Museum of the Weird's innovative designs were left on Crump's drawing board...until now! •  Brought to you by writer Brandon Seifert (Witch Doctor), artist Karl Moline (AVENGERS ARENA) and Shuster Award-winning cover artist Mike Del Mundo!\r\n\r\n","creators":"(W) Brandon Seifert (A) Karl Moline (CA) Mike Del Mundo"},{"title":"DISNEY KINGDOMS SEEKERS OF WEIRD #1 OF 5 CROSBY IMAGINEER","publisher":"MARVEL COMICS","itemCode":"NOV130641","sellDate":"1/15/2014","price":"3.99","description":"AN ALL-NEW ADVENTURE INSPIRED BY DISNEY'S LEGENDARY BUT NEVER BUILT MUSEUM OF THE WEIRD! •  When their parents are kidnapped, teens Maxwell and Melody are thrust into a thrilling race through the world's most strange and dangerous museum as they unite with their mysterious and swashbuckling uncle to save their family and the world from an evil secret society! •  Envisioned by famous Walt Disney Imagineer Rolly Crump for Walt Disney in 1965, the Museum of the Weird's innovative designs were left on Crump's drawing board...until now! •  Brought to you by writer Brandon Seifert (Witch Doctor), artist Karl Moline (AVENGERS ARENA) and Shuster Award-winning cover artist Mike Del Mundo!\r\n\r\n","creators":"(W) Brandon Seifert (A) Karl Moline (CA) Brian Crosby"},{"title":"REVOLUTIONARY WAR DARK ANGEL #1","publisher":"MARVEL COMICS","itemCode":"NOV130644","sellDate":"1/15/2014","price":"3.99","description":"Part 2 of \"Revolutionary War\" •  When Shevaun Haldane experiences a troubling vision in Darkmoor Castle, she realizes danger may be coming for the heroes of Marvel UK. •  With time running out, Shevaun has no choice but to suit up as Dark Angel once again. •  An adventure that will take fans through the past, present, and future of Marvel UK!\r\n\r\n","creators":"(W) Kieron Gillen (A) Dietrich Smith (CA) Mark Brooks"},{"title":"SECRET AVENGERS #14","publisher":"MARVEL COMICS","itemCode":"NOV130652","sellDate":"1/15/2014","price":"3.99","description":"HOW TO MA.I.M. A MOCKINGBIRD, Part Three •  The traitor at the heart of the group is revealed. •  Mockingbird faces a crossroads that threatens to tear her apart. •  Travel to the past. See the future.\r\n\r\n","creators":"(W) Nick Spencer, Ales Kot (A/CA) Butch Guice"},{"title":"CATACLYSM ULTIMATES #3 OF 3","publisher":"MARVEL COMICS","itemCode":"NOV130655","sellDate":"1/15/2014","price":"3.99","description":"• The Ultimate Weapon falls into Galactus's hands. •  A plague consumes Europe. •  A point of no return for Nick Fury and the Howling Commandoes\r\n\r\n","creators":"(W) Joshua Hale Fialkov (A) Carmine Di Giandomenico (CA) Mukesh Singh"},{"title":"SUPERIOR SPIDER-MAN #25","publisher":"MARVEL COMICS","itemCode":"NOV130660","sellDate":"1/15/2014","price":"4.99","description":"Special super-sized 25th issue! •  Otto Octavius, the Superior Spider-Man, in a life-or-death struggle against the original Superior Venom! •  Plus: With one last goblin on his side, the Goblin King's court is now complete! •  Guest starring: The Avengers!\r\n\r\n","creators":"(W) Dan Slott, Christos N. Gage (A/CA) Humberto Ramos"},{"title":"MARVEL KNIGHTS HULK #2 OF 4","publisher":"MARVEL COMICS","itemCode":"NOV130668","sellDate":"1/15/2014","price":"3.99","description":"CONTINUING THE ALL-NEW HULK EPIC SPOTLIGHTING TWO RISING STARS! •  An amnesiac Dr. Bruce Banner has awoken in Paris and now finds himself in a desperate power struggle...for the Hulk! •  Who wants Banner's monstrous alter ego to do their bidding-and what happens when he doesn't know who the Hulk is, or how to unleash him? •  A mind-bending mystery + creepy robots + crazy science = quirky cool Hulk action downloaded directly from the mad minds of Keatinge & Kowalski!\r\n\r\n","creators":"(W) Joe Keatinge (A/CA) Piotr Kowalski"},{"title":"THOR GOD OF THUNDER #17","publisher":"MARVEL COMICS","itemCode":"NOV130669","sellDate":"1/15/2014","price":"3.99","description":"THE GRAND FINALE OF THE ACCURSED! Thor's desperate tour of the Nine Realms brings him to Midgard, to Earth, where he makes his final stand against Malekith and the dark forces of the Wild Hunt. But what has become of Thor's newest compatriots, the League of Realms? Who stands revealed as the traitor in their midst? And what bloody victory has Malekith already won?\r\n\r\n","creators":"(W) Jason Aaron (A) Ron Garney, Emanuela Lupacchino (CA) Esad Ribic"},{"title":"FANTASTIC FOUR #16","publisher":"MARVEL COMICS","itemCode":"NOV130671","sellDate":"1/15/2014","price":"3.99","description":"FINAL ISSUE! The Fantastic Four are... DOOMED! Dr. Doom has taken on the power of Kang and Annihilus and is supreme ruler of the entire world. Good News: this is in the Doomed Universe. Bad News: our universe is next. The only ones in his way are the Fantastic Four and... the Fantastic Four! The Elemental Eight face off against Doom the Annihilating Conqueror with the fate of infinite realities in the balance! Plus the fate of Old John Storm! All in the fiery finish to the most mind-bending F4 adventure ever!\r\n\r\n","creators":"(W) Matt Fraction, Karl Kesel (A) Joe Quinones (CA) Mark Bagley"},{"title":"DAREDEVIL #35","publisher":"MARVEL COMICS","itemCode":"NOV130677","sellDate":"1/15/2014","price":"2.99","description":"• Daredevil pulls his allies together to make an all-out assault on the Sons of the Serpent before they can infest the rest of the nation--but he's about to find out just how blind justice can be! •  PLUS...You've demanded it! An appearance by Elektra that sets the stage for a huge change in Matt's life!\r\n\r\n","creators":"(W) Mark Waid (A/CA) Chris Samnee"},{"title":"NOVA #12","publisher":"MARVEL COMICS","itemCode":"NOV130678","sellDate":"1/15/2014","price":"3.99","description":"• Hot on the trail of the missing Nova Corps, Nova and manages to save the lives of some new friends in deep space.\r\n\r\n","creators":"(W) Gerry Duggan (A) Paco Medina (CA) Ed McGuinness"},{"title":"AMAZING X-MEN #3","publisher":"MARVEL COMICS","itemCode":"NOV130683","sellDate":"1/15/2014","price":"3.99","description":"• BEAST UNLEASHED! Dr. McCoy is pushed over the edge and gives into his savage side like never before! •  The X-Men, split between heaven and hell, are in way over their heads! •  Can they get to Nightcrawler before evil Azazel does?\r\n\r\n","creators":"(W) Jason Aaron (A/CA) Ed McGuinness"},{"title":"ALL NEW X-MEN #21","publisher":"MARVEL COMICS","itemCode":"NOV130685","sellDate":"1/15/2014","price":"3.99","description":"• X-23 is back, joining the ALL-NEW X-MEN and kissing Cyclops? What does this mean to Jean Grey? •  Jean and X-23 are forced to team up against a mysterious force, so she better figure it out\r\n\r\n","creators":"(W) Brian Michael Bendis (A) Brandon Peterson (CA) Stuart Immonen"},{"title":"UNCANNY X-FORCE #16","publisher":"MARVEL COMICS","itemCode":"NOV130686","sellDate":"1/15/2014","price":"3.99","description":"\"VENDETTA\" PART II •  Classic X-Force villain STRYFE has returned! And he's eager to exact his revenge on the man who left him broken and adrift in the timestream: CABLE. •  As Stryfe's plan comes to bear, Hope is brought face-to-face with Bishop, the man who crusaded across centuries in a mission to exterminate her. But this time around, she's ready to retaliate...and they'll hold nothing back as they race to destroy one another. •  Don't miss this no-holds-barred, knockdown, drag-out X-FORCE event! Because when the dust settles, only ONE X-Force team will be left standing...\r\n\r\n","creators":"(W) Sam Humphries (A) Harvey Tolibao (CA) Ramon K. Perez"},{"title":"X-MEN LEGACY #22","publisher":"MARVEL COMICS","itemCode":"NOV130690","sellDate":"1/15/2014","price":"2.99","description":"• War and death, nations turning against nations...the demonic shade of the deceased Professor Xavier that has been plaguing Legion's psyche has escaped into the real world. What price will Legion pay to stop him from razing the Earth? •  And prophesied to stop Legion and imbued with the power she needs to do so, will Young X-Man Blindfold take matters into her own hands and extinguish her first love? •  One thing's for sure: as this groundbreaking series races to its conclusion, anything is possible!\r\n\r\n","creators":"(W) Simon Spurrier (A) Khoi Pham (CA) Mike Del Mundo"},{"title":"UNCANNY X-MEN #16","publisher":"MARVEL COMICS","itemCode":"NOV130692","sellDate":"1/15/2014","price":"3.99","description":"• Magneto reaches a crossroads. Everything he's fought for is called into question and he's forced to make a decision that will change him forever!\r\n\r\n","creators":"(W) Brian Michael Bendis (A/CA) Chris Bachalo"},{"title":"NIGHT OF LIVING DEADPOOL #1 OF 4","publisher":"MARVEL COMICS","itemCode":"NOV130696","sellDate":"1/15/2014","price":"3.99","description":"• Deadpool awakes from a food coma to find...THE ZOMBIE APOCALYPSE HAS OCCURRED! •  Can the Merc with the Mouth avoid becoming the Merc in their Mouths? •  Writer of the DEADPOOL KILLOGY Cullen Bunn brings us to one of Deadpool's darkest tales ever...and not just because it's in black & white (and red)!\r\n\r\n","creators":"(W) Cullen Bunn (A) Ramon Rosanas (CA) Jay Shaw"},{"title":"WOLVERINE MAX #15 ","publisher":"MARVEL COMICS","itemCode":"NOV130698","sellDate":"1/15/2014","price":"3.99","description":"Series finale! •  Will Logan get the answers he's looking for, or just more questions? •  At the end of everything, he makes a decision that will change his life forever. THERE IS A STRICT NO OVERPRINT POLICY ON ALL MAX TITLES.\r\n\r\n","creators":"(W) Jason Starr (A) Felix Ruiz (CA)   Jock","mature":true},{"title":"GRAVEL COMBAT MAGICIAN #0 ","publisher":"AVATAR PRESS INC","itemCode":"NOV130814","sellDate":"1/29/2014","price":"4.99","description":"Gravel returns with a super-size launch issue and an all-new monthly series!  Mike Wolfer has worked on every issue of Gravel to date, and he's back to his black magic ways, joined by artist Gabriel Rearte who is conjuring stunning pages!  This #0 is a perfect starting place for new readers, with a self-contained story and a huge what-has-come-before summary of all the previous Gravel issues.  After dismantling the aristocratic, magical hierarchy of England and surviving a war against a blood-thirsty serial killer, William Gravel disappeared. But even a man who can walk through walls cannot escape Combat Magic-fueled assassins. And he's not happy about it. Written by long-time Warren Ellis collaborator MIKE WOLFER, GRAVEL: COMBAT MAGICIAN presents a fresh starting point for new readers to enter the world of ultra-violent black magic.  Available with a Regular cover by artist Gabriel Rearte, Wraparound, Horror and a Black Magic Order Incentive cover by Wolfer.\r\n\r\n","creators":"(W) Mike Wolfer (A/CA) Gabriel Rearte","mature":true},{"title":"GRAVEL COMBAT MAGICIAN #0 WRAP CVR ","publisher":"AVATAR PRESS INC","itemCode":"NOV130815","sellDate":"1/29/2014","price":"4.99","description":"Gravel returns with a super-size launch issue and an all-new monthly series!  Mike Wolfer has worked on every issue of Gravel to date, and he's back to his black magic ways, joined by artist Gabriel Rearte who is conjuring stunning pages!  This #0 is a perfect starting place for new readers, with a self-contained story and a huge what-has-come-before summary of all the previous Gravel issues.  After dismantling the aristocratic, magical hierarchy of England and surviving a war against a blood-thirsty serial killer, William Gravel disappeared. But even a man who can walk through walls cannot escape Combat Magic-fueled assassins. And he's not happy about it. Written by long-time Warren Ellis collaborator MIKE WOLFER, GRAVEL: COMBAT MAGICIAN presents a fresh starting point for new readers to enter the world of ultra-violent black magic.  Available with a Regular cover by artist Gabriel Rearte, Wraparound, Horror and a Black Magic Order Incentive cover by Wolfer.\r\n\r\n","creators":"(W) Mike Wolfer (A) Gabriel Rearte (CA) Mike Wolfer","mature":true},{"title":"GRAVEL COMBAT MAGICIAN #0 HORROR CVR ","publisher":"AVATAR PRESS INC","itemCode":"NOV130816","sellDate":"1/29/2014","price":"4.99","description":"Gravel returns with a super-size launch issue and an all-new monthly series!  Mike Wolfer has worked on every issue of Gravel to date, and he's back to his black magic ways, joined by artist Gabriel Rearte who is conjuring stunning pages!  This #0 is a perfect starting place for new readers, with a self-contained story and a huge what-has-come-before summary of all the previous Gravel issues.  After dismantling the aristocratic, magical hierarchy of England and surviving a war against a blood-thirsty serial killer, William Gravel disappeared. But even a man who can walk through walls cannot escape Combat Magic-fueled assassins. And he's not happy about it. Written by long-time Warren Ellis collaborator MIKE WOLFER, GRAVEL: COMBAT MAGICIAN presents a fresh starting point for new readers to enter the world of ultra-violent black magic.  Available with a Regular cover by artist Gabriel Rearte, Wraparound, Horror and a Black Magic Order Incentive cover by Wolfer.\r\n\r\n","creators":"(W) Mike Wolfer (A) Gabriel Rearte (CA) Mike Wolfer","mature":true},{"title":"ROVER RED CHARLIE #2 OF 6 ","publisher":"AVATAR PRESS INC","itemCode":"NOV130827","sellDate":"1/29/2014","price":"3.99","description":"Three canine best friends try to make their way at the end of the world.  Having fled the death and destruction of the city, Rover, Red, and Charlie find that feeders aren't the only ones you can't trust in this topsy-turvy world.  When they meet up with a wary hisspot, they find out that this new world order is even crazier than they could imagine.  GARTH ENNIS - the father of Preacher and Crossed - delivers a story like no other, as an unlikely band of canines set out to survive in a world gone horribly mad and fully-painted by Michael Dipascale.  Step into the mind of man's best friend!  Available with a Regular, Wraparound, and a Dog Days Order Incentive cover by series artist Michael Dipascale.  \r\n\r\n","creators":"(W) Garth Ennis (A/CA) Michael DiPascale","mature":true},{"title":"ROVER RED CHARLIE #2 OF 6 WRAP CVR ","publisher":"AVATAR PRESS INC","itemCode":"NOV130828","sellDate":"1/29/2014","price":"3.99","description":"Three canine best friends try to make their way at the end of the world.  Having fled the death and destruction of the city, Rover, Red, and Charlie find that feeders aren't the only ones you can't trust in this topsy-turvy world.  When they meet up with a wary hisspot, they find out that this new world order is even crazier than they could imagine.  GARTH ENNIS - the father of Preacher and Crossed - delivers a story like no other, as an unlikely band of canines set out to survive in a world gone horribly mad and fully-painted by Michael Dipascale.  Step into the mind of man's best friend!  Available with a Regular, Wraparound, and a Dog Days Order Incentive cover by series artist Michael Dipascale.  \r\n\r\n","creators":"(W) Garth Ennis (A/CA) Michael DiPascale","mature":true},{"title":"GOD IS DEAD #5 ","publisher":"AVATAR PRESS INC","itemCode":"NOV130843","sellDate":"1/29/2014","price":"3.99","description":"The world is only hours away from Armageddon as the pantheons of Asgard and Olympus collide.  With the first attempt at creating a god weapon resulting in the birth of Mammon, the enclave of scientists strikes a desperate stake as they hope they can create a being able to stand against the deities waging war across the globe.  But tampering with the very stuff of gods is a dangerous game and the end result is nothing short of staggering...  Join JONATHAN HICKMAN for the end of the world as God Is Dead rolls toward an unbelievable climax!  Available with a Regular cover by Jonathan Hickman, End of Days cover, a premium Iconic card stock cover that is limited to just 5000 copies by Jacen Burrows, and a Pantheon Order Incentive cover by series artist Di Amorim.  \r\n\r\n","creators":"(W) Jonathan Hickman (A) Di Amorim (CA) Jonathan Hickman","mature":true},{"title":"GOD IS DEAD #5 END OF DAYS CVR ","publisher":"AVATAR PRESS INC","itemCode":"NOV130844","sellDate":"1/29/2014","price":"3.99","description":"The world is only hours away from Armageddon as the pantheons of Asgard and Olympus collide.  With the first attempt at creating a god weapon resulting in the birth of Mammon, the enclave of scientists strikes a desperate stake as they hope they can create a being able to stand against the deities waging war across the globe.  But tampering with the very stuff of gods is a dangerous game and the end result is nothing short of staggering...  Join JONATHAN HICKMAN for the end of the world as God Is Dead rolls toward an unbelievable climax!  Available with a Regular cover by Jonathan Hickman, End of Days cover, a premium Iconic card stock cover that is limited to just 5000 copies by Jacen Burrows, and a Pantheon Order Incentive cover by series artist Di Amorim.  \r\n\r\n","creators":"(W) Jonathan Hickman (A) Di Amorim (CA) Jacen Burrows","mature":true},{"title":"GOD IS DEAD #5 ICONIC CVR  ","publisher":"AVATAR PRESS INC","itemCode":"NOV130845","sellDate":"1/29/2014","price":"4.99","description":"The world is only hours away from Armageddon as the pantheons of Asgard and Olympus collide.  With the first attempt at creating a god weapon resulting in the birth of Mammon, the enclave of scientists strikes a desperate stake as they hope they can create a being able to stand against the deities waging war across the globe.  But tampering with the very stuff of gods is a dangerous game and the end result is nothing short of staggering...  Join JONATHAN HICKMAN for the end of the world as God Is Dead rolls toward an unbelievable climax!  Available with a Regular cover by Jonathan Hickman, End of Days cover, a premium Iconic card stock cover that is limited to just 5000 copies by Jacen Burrows, and a Pantheon Order Incentive cover by series artist Di Amorim.\r\n\r\n","creators":"(W) Jonathan Hickman (A) Di Amorim (CA) Jacen Burrows","mature":true},{"title":"SIMPSONS COMICS #208","publisher":"BONGO COMICS","itemCode":"NOV130858","sellDate":"1/15/2014","price":"2.99","description":"Bart is separated from his family at the airport, gets on the wrong flight, and ends up in a seat reserved for a boy his age named \"Brit\" Simpson, ending up in England. Once there, Bart finds himself in the town of Springshire, where everything looks and everyone acts all too familiar. He even has to evade the evil Sideshow Bobby, a former police officer with a grudge against Brit.\r\n\r\n","creators":"(W) Ian Boothby, John Delaney"},{"title":"CURSE #1 OF 4","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV130863","sellDate":"1/15/2014","price":"3.99","description":"WHY WE LOVE IT: BOOM! Studios has a long history of publishing some of the industry's best modern horror, and CURSE takes us back to our roots with a werewolf story unlike any you've ever seen. WHY YOU WILL LOVE IT: The CURSE creative team practically screams \"horror\" from writers Michael Moreci (HOAX HUNTERS) & Tim Daniel (ENORMOUS) and artists Riley Rossmo (DRUMHELLAR) & Colin Lorimer (UXB), you're in store for a smart, realistic, and haunting read. WHAT IT'S ABOUT: Laney Griffith is a man who will do anything to save his son from leukemia, but the cost of treatment has broken him financially. When he pursues an elusive murderer in the wilderness of his small, rural community, in the hopes of securing a substantial bounty, Laney is confronted with something he never could have expected: a werewolf. The captive lycan, in human form, turns Laney's life upsidedown, forcing him to confront his haunted past and race against the clock-because the wolf will return, and Laney's son's condition continues to worsen. CURSE is a story of a family's survival at all costs.\r\n\r\n","creators":"(W) Michael Moreci, Tim Daniel (A) Riley Rossmo, Colin Lorimer (CA) Riley Rossmo"},{"title":"IMAGINE AGENTS #4 OF 4","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV130867","sellDate":"1/15/2014","price":"3.99","description":"Dapple's plan has taken a turn for the worse, and no man, woman, or figment is safe! With Elliot in the clutches of evil and Furdlegurr in the stomach of evil, Rebecca and Terry must find a way to rescue them without getting stomped out in the process. It is up to Dave to overcome his resentment of figments and work with Blounder to take Dapple down once and for all.\r\n\r\n","creators":"(W) Brian Joines (A)   Bachan (CA) Khary Randolph"},{"title":"3 GUNS #6 OF 6","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV130873","sellDate":"1/15/2014","price":"3.99","description":"Nothing is as it seems. While anything but a friendship has formed between Marcus and Bobby, they must rely entirely on each other if they want to make it out of this alive. With Joey at their side, this might be just the advantage they need. Unfortunately, they will never see what Ckota has coming...\r\n\r\n","creators":"(W) Steven Grant (A) Emilio Laiso (CA) Rafael Albuquerque"},{"title":"HELLRAISER DARK WATCH #12 ","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV130876","sellDate":"1/15/2014","price":"3.99","description":"FINAL ISSUE. The war between Hells reaches its climax, and the fates of Elliott Spencer, Kirsty Cotton, and Harry D'Amour hang in the balance\r\n\r\n","creators":"(W) Clive Barker, Brandon Seifert (A) Tom Garcia (CA) Sami Makkonen","mature":true},{"title":"ADVENTURE TIME #24 MAIN CVRS ","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV130913","sellDate":"1/15/2014","price":"3.99","description":"Princess Bubblegum faces the consequences of her science experiment gone wrong as she finally finds a way to save the day! But is it too late? Find out if Princess Bubblegum is able to right all her wrongs or if her friends will never be themselves again, it's a crazy conclusion to this arc!\r\n\r\n","creators":"(W) Kristina Ness (A) Shelli Paroline & Various (CA) Mike Holmes, Brad McGinty"},{"title":"LIL BATTLESTAR GALACTICA #1","publisher":"DYNAMIC FORCES","itemCode":"NOV130959","sellDate":"1/15/2014","price":"3.99","description":"AW YEAH BATTLESTAR GALACTICA! The search for Earth continues in this awesome epic event of tiny proportions! Who are these Cylons? Are they friends or foes? Does complaining to daddy Adama help or make things worse? Fear not, Apollo and Starbuck are here to save the day! Find out the answers to questions you've always wanted answered: How old do you have to be to ride a colonial viper? Is there a height requirement? And what does Baltar have to say in all of this? And where do Baby Cylons come from? Come join the new and smaller adventures aboard the Battlestar Galactica. And if that isn't enough, each Li'l book comes with a two-page activity sheet!\r\n\r\n","creators":"(W) Art Baltazar,   Franco (A) Art Baltazar"},{"title":"LIL BATTLESTAR GALACTICA #1 EXC SUBSCRIPTION CVR","publisher":"DYNAMIC FORCES","itemCode":"NOV130960","sellDate":"1/15/2014","price":"3.99","description":"For comic fans that signed up ahead of time with their comic shop to reserve this issue, you can receive an exclusive Agnes Garbowska cover! This Super Special Subscription Variant is only available for Comic Shop subscribers and limited to INITIAL orders ONLY!\r\n\r\n","creators":"(W) Art Baltazar,   Franco (A) Art Baltazar (CA) Agnes Garbowska"},{"title":"SHADOW NOW #4 OF 6","publisher":"DYNAMIC FORCES","itemCode":"NOV130979","sellDate":"1/15/2014","price":"3.99","description":"Uneasy alliances abound as Khan, pursing his own dangerous endgame, places the assassination of the Shadow in Batu's hands. As Batu bristles under her grandfather's watchful eye, she forms a dangerous partnership with a local gang leader who claims to have the key to defeating the Shadow. Meanwhile, the Shadow draws both the Russian and Vietnamese mafias into his orbit, preparing to turn rivals into deadly enemies. Long-plotted schemes come to fruition as the Shadow moves to defeat his greatest enemy!\r\n\r\n","creators":"(W) David Liss (A) Colton Worley (CA) Tim Bradstreet"},{"title":"NOIR #3 OF 5","publisher":"DYNAMIC FORCES","itemCode":"NOV130993","sellDate":"1/15/2014","price":"3.99","description":"The unlikely team of The Black Sparrow and Miss Fury strong arm the Mohawk Akash into revealing a map they hope will lead them to the lost treasure of the Templars. But is the map actually worthless without the rune codes? Their quest takes them deep into the wilderness and to an ancient place that's been locked away for centuries. Danger and betrayal lurk around every corner.\r\n\r\n","creators":"(W) Victor Gischler (A) Andrea Mutti (CA) Ardian Syaf"},{"title":"GRIMM #9","publisher":"DYNAMIC FORCES","itemCode":"NOV131000","sellDate":"1/15/2014","price":"3.99","description":"The Portland Police Department finds itself in disarray as a mysterious, hulking Wesen starts picking off cops one by one in its frantic search for the \"Grimm.\" With his fellow officers caught in the crossfire, Nick must throw himself headfirst into danger if he has any hope to stop the monster before it claims another colleague's life.\r\n\r\n","creators":"(W) Marc Gaffen, Kyle McVey (A) Rod Rodolfo (CA) Lucio Parillo"},{"title":"JENNIFER BLOOD #35 ","publisher":"DYNAMIC FORCES","itemCode":"NOV131024","sellDate":"1/15/2014","price":"3.99","description":"As the Blood Legacy arc reaches its climax, Jennifer comes face-to-face with her nemesis in a blood-drenched conflict that leads her to finally confront the shocking reality of what she has become, and the true cost of her quest for revenge.\r\n\r\n","creators":"(W) Michael Carroll (A) Kewber Baal (CA) Colton Worley","mature":true},{"title":"SIXTH GUN #37","publisher":"ONI PRESS INC.","itemCode":"NOV131169","sellDate":"1/15/2014","price":"3.99","description":"Drake and Becky lead a posse in pursuit of their enemies-and they've found them! Beset on all sides by murderous enemies, Becky has her final showdown with Missy Hume. And if that wasn't enough... in the midst of a deadly shoot-out... our heroes are betrayed by one of their own!\r\n\r\n","creators":"(W) Cullen Bunn (A/CA) Brian Hurtt"},{"title":"DEPARTMENT OF MONSTEROLOGY #4 OF 4","publisher":"RENEGADE ARTS ENTERTAINMENT","itemCode":"NOV131223","sellDate":"1/15/2014","price":"3.99","description":"The finale to the first arc reaches an explosive finish as Team Carnaski are attacked by possessed Samwi and now face probable oblivion, while back at HQ someone may have uncovered the secret of Team Carter's disappearance!\r\n\r\n","creators":"(W) Gordon Rennie (A/CA) P. j. Holden"},{"title":"HARBINGER #20 REG HENRY","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131276","sellDate":"1/15/2014","price":"3.99","description":"MUST READ VALIANT! All-new arc, all-new jumping-on point! Joshua Dysart and Clayton Henry launch \"RESISTANCE\"- and end the Renegades war against Toyo Harada once and for all. Peter Stanchek and his team of teenage superhuman outlaws have decided that the best defense is a strong offense. Pursued from coast to coast by their would-be overlord in the Harbinger Foundation, the Renegades are about to launch a strategic strike on Harada's secret empire - and they'll start by revealing to the world just what kind of power they've been hiding all along. The ace up their sleeve? A seemingly normal teenage hacker named Ax...who knows exactly what Harada has been up to since day one...\r\n\r\n","creators":"(W) Joshua Dysart (A/CA) Clayton Henry"},{"title":"HARBINGER #20 PULLBOX MONTOYA","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131277","sellDate":"1/15/2014","price":"3.99","description":"MUST READ VALIANT! All-new arc, all-new jumping-on point! Joshua Dysart and Clayton Henry launch \"RESISTANCE\"- and end the Renegades war against Toyo Harada once and for all. Peter Stanchek and his team of teenage superhuman outlaws have decided that the best defense is a strong offense. Pursued from coast to coast by their would-be overlord in the Harbinger Foundation, the Renegades are about to launch a strategic strike on Harada's secret empire - and they'll start by revealing to the world just what kind of power they've been hiding all along. The ace up their sleeve? A seemingly normal teenage hacker named Ax...who knows exactly what Harada has been up to since day one...\r\n\r\n","creators":"(W) Joshua Dysart (A) Clayton Henry (CA) Zach Montoya"},{"title":"MUST READ VALIANT GREATEST HITS #1 ","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131279","sellDate":"1/15/2014","price":"5.99","description":"Never tried a Valiant comic?! Start reading here - with more than 100 pages of Valiant Comics greatness for just $5.99!   Find out why VALIANT is the MUST READ superhero publisher in comics today with a greatest hits collection of can't-miss moments from across the Valiant Universe! Re-presenting X-O MANOWAR #5, QUANTUM AND WOODY #1, HARBINGER #1, HARBINGER WARS #2, and SHADOWMAN #0, MUST READ VALIANT: GREATEST HITS #1 is the perfect place to find out why IGN is declaring: \"Nobody is making superhero books like this, which is exactly why you should be paying attention to Valiant Comics.\"\r\n\r\n","creators":"(W) Robert Venditti & Various (A) Lee Garbett & Various (CA)   TBD"},{"title":"UNITY #3","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131283","sellDate":"1/15/2014","price":"3.99","description":"Enter: Livewire! On an airtight team of stone-cold soldiers, Amanda McKee is the one variable in the equation that equals absolute kill. Now, as the last woman standing against the unstoppable force known as X-O Manowar, the Harbinger Foundation's most seasoned technopath has just added one new item to her resume -- newest bearer of the X-O Manowar armor and the finger behind the trigger of the universe's most powerful weapon. Watch out world...this means trouble.\r\n\r\n","creators":"(W) Matt Kindt (A/CA) Doug Braithwaite"},{"title":"UNITY #3 ORDERALL JG JONES","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131284","sellDate":"1/15/2014","price":"3.99","description":"Enter: Livewire! On an airtight team of stone-cold soldiers, Amanda McKee is the one variable in the equation that equals absolute kill. Now, as the last woman standing against the unstoppable force known as X-O Manowar, the Harbinger Foundation's most seasoned technopath has just added one new item to her resume -- newest bearer of the X-O Manowar armor and the finger behind the trigger of the universe's most powerful weapon. Watch out world...this means trouble.\r\n\r\n","creators":"(W) Matt Kindt (A) Doug Braithwaite (CA) J. G. Jones"},{"title":"ARCHER & ARMSTRONG #17 REG HENRY","publisher":"VALIANT ENTERTAINMENT LLC","itemCode":"NOV131290","sellDate":"1/15/2014","price":"3.99","description":"The SECT CIVIL WAR reaches its earth-shattering climax (and for once we mean that literally)! ARCHER versus ARMSTRONG! An incredible second identity for MARY-MARIA! Obadiah Archer gets a bold new role - and mission! The secret of the MASTER BUILDERS revealed! We were kidding, before but now we're serious: This one changes EVERYTHING, and the Valiant Universe will never be the same again!\r\n\r\n","creators":"(W) Fred Van Lente (A) Khari Evans (CA) Clayton Henry"},{"title":"COMIC SHOP NEWS 90CT BUNDLE #1387 ","publisher":"COMIC SHOP NEWS INC","itemCode":"NOV131444","sellDate":"1/15/2014","price":"PI","description":"Comic Shop News is comics' weekly newsletter. Each issue is full-color, 8-12 pages in length, and features CSNsider, news, and interviews. CSN has a complete monthly checklist (complete with PREVIEWS order numbers), plus exclusive CSN Hot Picks, \"Fab Firsts,\" and a monthly checklist of all the first issues for the month!\r\n\r\n","creators":""},{"title":"STAR TREK MAGAZINE #48 NEWSSTAND ED ","publisher":"TITAN","itemCode":"NOV131464","sellDate":"1/29/2014","price":"9.99","description":"Space, the final frontier... or is it? In the next issue of The Official Star Trek Magazine, we follow the journeys of prominent Trek characters who stepped away from Starfleet to explore the universe on their own terms. We turn the spotlight on galactic irritants Q and Trelaine in archive feature \"Time's Arrow\" and discover that death was no barrier to the adventures of Captain James T. Kirk. We also speak to not one but two Christopher Pikes, in exclusive interviews with Bruce Greenwood and Sean Kenney, plus there's new original fiction direct from Star Trek Online. Featuring all the latest Star Trek news, merchandise reviews, and fun competitions. Available in Newsstand and PREVIEWS Exclusive editions.\r\n\r\n","creators":""},{"title":"STAR TREK MAGAZINE #48 PX ED ","publisher":"TITAN","itemCode":"NOV131465","sellDate":"1/29/2014","price":"9.99","description":"Space, the final frontier... or is it? In the next issue of The Official Star Trek Magazine, we follow the journeys of prominent Trek characters who stepped away from Starfleet to explore the universe on their own terms. We turn the spotlight on galactic irritants Q and Trelaine in archive feature \"Time's Arrow\" and discover that death was no barrier to the adventures of Captain James T. Kirk. We also speak to not one but two Christopher Pikes, in exclusive interviews with Bruce Greenwood and Sean Kenney, plus there's new original fiction direct from Star Trek Online. Featuring all the latest Star Trek news, merchandise reviews, and fun competitions. Available in Newsstand and PREVIEWS Exclusive editions.\r\n\r\n","creators":""},{"title":"DAY MEN #2 (2ND PTG) (PP #1107)","publisher":"BOOM ENTERTAINMENT","itemCode":"NOV138111","sellDate":"1/15/2014","price":"3.99","description":"From BOOM! Entertainment. David Reid is not having a good day. A fullblown war has erupted between the Virgo and Ramses families, and David is left to pick up the pieces while his vampire employers sleep. But with the Ramses' legendary Day Man Jacob the Burner on his tail, will David even make it to sundown? Scheduled to ship 01/08/14. (6679)\r\n\r\n\r\n","creators":"(W) Matt Gagnon, Michael Alan Nelson (A/CA) Brian Stelfreeze"},{"title":"MAGIC THE GATHERING THEROS #3 OF 5","publisher":"IDW PUBLISHING","itemCode":"OCT130422","sellDate":"1/15/2014","price":"4.99","description":"Dack Fayden has managed to assemble the powerful artifact that first brought him to THEROS. But as a monster of the deep attacks the vessel he sails on, Dack must put his new acquisition to good use... and fast!                                                            This issue includes an exclusive, alternate art playable Magic: The Gathering card!\r\n\r\n","creators":"(W) Jason Ciaramella (A) Martin Coccolo (CA) Volkan Baga"},{"title":"RAT QUEENS #4 CVR A ","publisher":"IMAGE COMICS","itemCode":"OCT130614","sellDate":"1/15/2014","price":"3.50","description":"\"GOLD, GUTS, AND GROG,\" Part Four Holy vengeance can be a real headache, but it's so much worse when it's coming from a fifteen foot tall lady troll who's just lost her dad. In this blood-splattered issue, the Rat Queens find out that every action has some sort of hilariously brutal consequence!  RAT QUEENS ships with two covers by ROC UPCHURCH, which may be ordered separately.\r\n\r\n","creators":"(W) Kurtis J. Wiebe (A/CA) Roc Upchurch","mature":true},{"title":"RAT QUEENS #4 CVR B ","publisher":"IMAGE COMICS","itemCode":"OCT130615","sellDate":"1/15/2014","price":"3.50","description":"\"GOLD, GUTS, AND GROG,\" Part Four Holy vengeance can be a real headache, but it's so much worse when it's coming from a fifteen foot tall lady troll who's just lost her dad. In this blood-splattered issue, the Rat Queens find out that every action has some sort of hilariously brutal consequence!  RAT QUEENS ships with two covers by ROC UPCHURCH, which may be ordered separately.\r\n\r\n","creators":"(W) Kurtis J. Wiebe (A/CA) Roc Upchurch","mature":true},{"title":"VELVET #3 ","publisher":"IMAGE COMICS","itemCode":"OCT130631","sellDate":"1/15/2014","price":"2.99","description":"You all know the story: a beautiful woman seduced by a secret agent into revealing secrets and helping him on his mission...but what happens to them once the agent is gone? Find out in issue three, as Velvet tracks Agent X-14's most recent asset down very dark paths.\r\n\r\n","creators":"(W) Ed Brubaker (A) Steve Epting, Elizabeth Breitweiser (CA) Steve Epting","mature":true},{"title":"PRINCELESS ENCORE ED #2 OF 4","publisher":"ACTION LAB ENTERTAINMENT","itemCode":"OCT130795","sellDate":"6/25/2014","price":"2.99","description":"Now's your chance to experience Adrienne's Eisner-nominated first adventure again or for the first time. Adrienne is determined to save her youngest sister Appalonia, but to do so she's going to have to raid her own family's castle and face the scariest guardian of all - her father!\r\n\r\n","creators":"(W) Jeremy Whitley (A/CA) M Goodwin"},{"title":"BETTY & VERONICA #269 REG CVR","publisher":"ARCHIE COMIC PUBLICATIONS","itemCode":"OCT130865","sellDate":"1/15/2014","price":"2.99","description":"\"Just Another Day.\" This issue presents a first for an Archie Comic: An entire story happening in real time (well, comic book real time that is)! Find out what a typical day is like for Betty, Veronica and Archie!  Do they go about their day like every other teenager? Of course not!  Follow along with the infamous love triangle as we get a peek into the typical day of a Riverdale teen-with not so typical outcomes! Featuring story and art by fan favorite Archie artist Dan Parent and another installment of the classic art-inspired variant cover series by Jeff Shultz!\r\n\r\n","creators":"(W) Dan Parent (A) Jeff Shultz (CA) Dan Parent, Bob Smith"},{"title":"JUGHEADS DOUBLE DIGEST #199","publisher":"ARCHIE COMIC PUBLICATIONS","itemCode":"OCT130869","sellDate":"1/15/2014","price":"3.99","description":"Ever wonder how a small town like Riverdale manages to stay local and keep big name chain stores away? Well, it's a bit of an odd story-and Jughead has everything to do with it! Find out how Jughead shaped the financial model of the town in \"Give Me a Sign\"! \r\n\r\n","creators":"(W) Craig Boldman (A) Rex Lindsey & Various (CA) Fernando Ruiz & Various"},{"title":"MEGA MAN #33 REG CVR","publisher":"ARCHIE COMIC PUBLICATIONS","itemCode":"OCT130872","sellDate":"1/15/2014","price":"2.99","description":"The critically acclaimed Mega Man series continues with the dramatic, action-packed epilogue to the \"Blackout: The Curse of Ra Moon\" storyline in, \"Unplugged\"! The battle against the sinister alien being known as Ra Moon has ended, and Mega Man's final fate remains in doubt! With major repairs looming, and Rock's future as a super fighting robot in question, Dr. Light must work to restore our hero to his former glory. This may be a job that even Dr. Light can't handle, but at least he's got some help from his trusty pal Dr. Wily. Wait! Why on earth is the evil scientist helping to save the Blue Bomber? And how far will Dr. Wily go to remain free? Featuring cover art from Brent McCarthy and a special variant cover from Mega Man artist supreme Patrick \"SPAZ\" Spaziante!\r\n\r\n","creators":"(W) Ian Flynn (A) Gary Martin & Various (CA) Brent McCarthy"},{"title":"SONIC THE HEDGEHOG #256 REG CVR","publisher":"ARCHIE COMIC PUBLICATIONS","itemCode":"OCT130874","sellDate":"1/15/2014","price":"2.99","description":"It's the dramatic conclusion to the epic \"Countdown to Chaos\" saga! In Part Four, it's a race against time as the countdown reaches its thrilling end! Metal Sonic is out to kill Sally and the Death Egg II has launched-things are not going well for our true blue hero! Can he and Tails get to the Aquatic Ruins Zone in time to save the day? And what horrifying discovery awaits Dr. Eggman? You definitely won't want to miss this earth-shattering climax of the storyline that shook the Sonic comic books to the core! Featuring the final adjoining cover in the series from artist Ben Bates, and a special \"end of the world\" variant cover from Tracy Yardley!\r\n\r\n","creators":"(W) Ian Flynn (A) John Workman & Various (CA) Ben Bates"},{"title":"STITCHED #18 ","publisher":"AVATAR PRESS INC","itemCode":"OCT130923","sellDate":"6/25/2014","price":"3.99","description":"It's all been leading to this!  The final showdown between the Shinju-kai and the newly transformed \"Stitches\" begins here.   Kenji Nakamura leads his supernatural samurai into the very heart of the Shinju-kai office building, but he doesn't know that the Shinju-kai have prepared for the assault.  Betrayal is the order of the day and no one but Katsumi knows the hideous secrets of the Stitched!  Available with a Regular, Wraparound, Gore, and special Slashed Incentive cover by series artist Fernando Furukawa.\r\n\r\n","creators":"(W) Mike Wolfer (A/CA) Fernando Heinz Furukawa","mature":true},{"title":"STITCHED #18 WRAP CVR ","publisher":"AVATAR PRESS INC","itemCode":"OCT130924","sellDate":"6/25/2014","price":"3.99","description":"It's all been leading to this!  The final showdown between the Shinju-kai and the newly transformed \"Stitches\" begins here.   Kenji Nakamura leads his supernatural samurai into the very heart of the Shinju-kai office building, but he doesn't know that the Shinju-kai have prepared for the assault.  Betrayal is the order of the day and no one but Katsumi knows the hideous secrets of the Stitched!  Available with a Regular, Wraparound, Gore, and special Slashed Incentive cover by series artist Fernando Furukawa.\r\n\r\n","creators":"(W) Mike Wolfer (A/CA) Fernando Heinz Furukawa","mature":true},{"title":"STITCHED #18 GORE CVR ","publisher":"AVATAR PRESS INC","itemCode":"OCT130925","sellDate":"6/25/2014","price":"3.99","description":"It's all been leading to this!  The final showdown between the Shinju-kai and the newly transformed \"Stitches\" begins here.   Kenji Nakamura leads his supernatural samurai into the very heart of the Shinju-kai office building, but he doesn't know that the Shinju-kai have prepared for the assault.  Betrayal is the order of the day and no one but Katsumi knows the hideous secrets of the Stitched!  Available with a Regular, Wraparound, Gore, and special Slashed Incentive cover by series artist Fernando Furukawa.\r\n\r\n","creators":"(W) Mike Wolfer (A/CA) Fernando Heinz Furukawa","mature":true},{"title":"GFT NO TOMORROW #5 OF 5 A CVR TOLIBAO ","publisher":"ZENESCOPE ENTERTAINMENT INC","itemCode":"OCT131430","sellDate":"1/15/2014","price":"2.99","description":"The stunning conclusion to Zenescope's epic horror/fantasy series is HERE! As the world teeters on the brink of the apocalypse itself, Patrick sets out to bring an end to Keres reign of terror no matter what the price. But in order to defeat death, he may have to make the greatest sacrifice.\r\n\r\n","creators":"(W) Raven Gregory (A)   TBD (CA) Harvey Tolibao","mature":true},{"title":"GFT NO TOMORROW #5 OF 5 B CVR ERIC J ","publisher":"ZENESCOPE ENTERTAINMENT INC","itemCode":"OCT131431","sellDate":"1/15/2014","price":"2.99","description":"The stunning conclusion to Zenescope's epic horror/fantasy series is HERE!   As the world teeters on the brink of the apocalypse itself, Patrick sets out to bring an end to Keres reign of terror no matter what the price.  But in order to defeat death itself he may have to become the very thing he fears most.  With the fate of the world in the balance will Patrick rise to the challenge and destroy the Grimm Reaper or will this truly be the day...with No Tomorrow?\r\n\r\n","creators":"(W) Raven Gregory (A)   TBD (CA) Eric J","mature":true},{"title":"GFT NO TOMORROW #5 OF 5 C CVR MASSAFERA ","publisher":"ZENESCOPE ENTERTAINMENT INC","itemCode":"OCT131432","sellDate":"1/15/2014","price":"2.99","description":"The stunning conclusion to Zenescope's epic horror/fantasy series is HERE!   As the world teeters on the brink of the apocalypse itself, Patrick sets out to bring an end to Keres reign of terror no matter what the price.  But in order to defeat death itself he may have to become the very thing he fears most.  With the fate of the world in the balance will Patrick rise to the challenge and destroy the Grimm Reaper or will this truly be the day...with No Tomorrow?\r\n\r\n","creators":"(W) Raven Gregory (A)   TBD (CA) Felipe Massafera","mature":true},{"title":"DC BATMAN AUTOMOBILIA FIG COLL MAG #24 CLASSIC TV SERIES BOA","publisher":"EAGLEMOSS PUBLICATIONS LTD","itemCode":"OCT131516","sellDate":"1/29/2014","price":"20.00","description":"The Batman Automobilia Collection is a new fortnightly series offering Batman fans and model car enthusiasts alike the chance to collect the most iconic vehicles to have ever been driven by Batman, featuring Batmobiles from the hit TV shows, the blockbusting films and 70 years of comics! New models are available every month and each model is accompanied by an exclusive collector's magazine. Continue your collection with the Batman TV Series Boat (#24) or the Batmobile from Batman: Legends of the Dark Knight #15 (#25).\r\n\r\n","creators":""},{"title":"UNCANNY AVENGERS #14 2ND PTG MCNIVEN VAR (PP #1105)","publisher":"MARVEL COMICS","itemCode":"OCT138239","sellDate":"1/15/2014","price":"3.99","description":"From Marvel Comics. Legendary artist Steve McNiven (Civil War, Guardians of the Galaxy) Joins Rick Remender (Captain America, Uncanny X-Force) in shaking the Marvel Universe to its core! How many Avengers must die to stop the Apocalypse Twins?! Wolverine fails mankind. Daken has his revenge. Wanda confesses her true love. Grim Reaper has his revenge. A heart-wrenching and desperate tale of betrayal, love, revenge and sacrifice. Scheduled to ship 01/15/14. (161)\r\n\r\n\r\n","creators":"(W) Rick Remender (A/CA) Steve McNiven"},{"title":"DC VS MASTERS OF THE UNIVERSE #4 OF 6","publisher":"DC COMICS","itemCode":"SEP130265","sellDate":"1/15/2014","price":"2.99","description":"At long last, the identity of Skeletor's dark master is revealed! Can the combined forces of the Masters of the Universe and the Justice League withstand the power of his dark magic?\r\n\r\n","creators":"(W) Keith Giffen, Antony Bedard (A) Dexter Soy (CA) Ed Benes"},{"title":"CLIVE BARKER NEXT TESTAMENT #7 OF 12 ","publisher":"BOOM ENTERTAINMENT","itemCode":"SEP130995","sellDate":"1/15/2014","price":"3.99","description":"As Tristan and Elspeth continue their race to Providence, their new traveling companions may hold the key to the mystery of Wick's brethren. Meanwhile, Wick's jealousy leads to a show of force unlike any of his previous acts.\r\n\r\n","creators":"(W) Clive Barker, Mark L. Miller (A) Haemi Jang (CA) Goni Montes","mature":true},{"title":"REGULAR SHOW #8 MAIN CVRS","publisher":"BOOM ENTERTAINMENT","itemCode":"SEP131015","sellDate":"6/25/2014","price":"3.99","description":"The newest issue of this not so regular REGULAR SHOW comic once again takes Mordecai and Rigby on an adventure that could only be found in a comic book! A great series for fans of slacker comedy, 80's humor and awesome, one-art!\r\n\r\n","creators":"(W) Nick Sumida, Kevin Burkhalter (A) Allison Strejlau, Kevin Burkhalter (CA) Lydia Paige, Reed Black"},{"title":"MISS FURY #8 CVR A TAN","publisher":"DYNAMIC FORCES","itemCode":"SEP131093","sellDate":"1/15/2014","price":"3.99","description":"The Pharoah of Time is alive and he and his enormous mothership have come to 1943's New York City for Miss Fury. But which one will he find? The immoral murderer with the samurai sword, the titanicc stash of grenades and the epic love of debauchery? Or the Miss Fury who is lost in time, grasping for a sense of sanity and for the good inside her. It's a metaphysical battle played out wiith mondo martial arts as two futures of our hero fight for supremacy, and only one Miss Fury is getting out alive.\r\n\r\n","creators":"(W) Rob Williams (A) Jackson Herbert (CA) Billy Tan"},{"title":"MISS FURY #8 CVR B SYAF","publisher":"DYNAMIC FORCES","itemCode":"SEP131094","sellDate":"1/15/2014","price":"3.99","description":"The Pharoah of Time is alive and he and his enormous mothership have come to 1943's New York City for Miss Fury. But which one will he find? The immoral murderer with the samurai sword, the titanicc stash of grenades and the epic love of debauchery? Or the Miss Fury who is lost in time, grasping for a sense of sanity and for the good inside her. It's a metaphysical battle played out wiith mondo martial arts as two futures of our hero fight for supremacy, and only one Miss Fury is getting out alive.\r\n\r\n","creators":"(W) Rob Williams (A) Jackson Herbert (CA) Ardian Syaf"},{"title":"MISS FURY #8 CVR C WORLEY","publisher":"DYNAMIC FORCES","itemCode":"SEP131095","sellDate":"1/15/2014","price":"3.99","description":"The Pharoah of Time is alive and he and his enormous mothership have come to 1943's New York City for Miss Fury. But which one will he find? The immoral murderer with the samurai sword, the titanicc stash of grenades and the epic love of debauchery? Or the Miss Fury who is lost in time, grasping for a sense of sanity and for the good inside her. It's a metaphysical battle played out wiith mondo martial arts as two futures of our hero fight for supremacy, and only one Miss Fury is getting out alive.\r\n\r\n","creators":"(W) Rob Williams (A) Jackson Herbert (CA) Colton Worley"},{"title":"MISS FURY #8 CVR D EVELY","publisher":"DYNAMIC FORCES","itemCode":"SEP131096","sellDate":"1/15/2014","price":"3.99","description":"The Pharoah of Time is alive and he and his enormous mothership have come to 1943's New York City for Miss Fury. But which one will he find? The immoral murderer with the samurai sword, the titanicc stash of grenades and the epic love of debauchery? Or the Miss Fury who is lost in time, grasping for a sense of sanity and for the good inside her. It's a metaphysical battle played out wiith mondo martial arts as two futures of our hero fight for supremacy, and only one Miss Fury is getting out alive.\r\n\r\n","creators":"(W) Rob Williams (A) Jackson Herbert (CA) Bilquis Evely"},{"title":"LENORE VOLUME II #9","publisher":"TITAN","itemCode":"SEP131322","sellDate":"1/22/2014","price":"3.99","description":"Taxidermy is missing and Lenore has an important question for him, so she forces Pooty and Ragamuffin to join her in a mighty quest, dressed as fantasy heroes, to rescue their lost friend from the evil clutches of something that is clutch-y. What obstacles will be thrown in the path of our brave and noble warriors? Honestly, no idea yet.\r\n\r\n","creators":"(W/A/CA) Roman Dirge"},{"title":"DC SUPERHERO CHESS FIG COLL MAG #47 MARTIAN MANHUNTER WHITE","publisher":"EAGLEMOSS PUBLICATIONS LTD","itemCode":"SEP131524","sellDate":"6/25/2014","price":"16.00","description":"The DC Chess Collection continues with the Justice League chess set which offers the comic fan and chess enthusiast alike the chance to collect fantastic and unique chess pieces, vivid representations of some of DC's greatest characters. Each character is superbly rendered, cast from a specially formulated metallised resin and painted by expert model-makers. Each chess piece is accompanied by a fascinating 16-page magazine featuring superb DC Comic artwork plus vital chess tips for players of all levels. Continue your Justice League collection with Martian Manhunter White Knight (#47) and Aquaman White Rook (#48).\r\n\r\n","creators":""}]